Public Attributes | List of all members
API_SplineType Struct Reference
Element Manager API
Represents a cubic or Bezier-spline. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_ExtendedPenType  | linePen
(Overridden) pen attribute index.
API_AttributeIndex  | ltypeInd
Line type attribute index.
bool  | roomSeparator
Is this arc a zone boundary?
short  | determination
Line category:
API_ArrowData  | arrowData
Arrow data for the arc ends.
double  | penWeight
Pen weight for the arc (can override the weight in linePen, otherwise set it to API_DefPenWeigth : use default weight of the pen).
bool  | autoSmooth
Smooth spline automatically, or use the bezierDirs field (of type API_SplineDir) in API_ElementMemo?
bool  | closed
Is this a closed curve?
Detailed Description
Represents a cubic or Bezier-spline.
Remarks
The coordinates of the spline points are given in the coords field of API_ElementMemo. The last and the first coordinate in coords should be different; and the coordinate with index 0 is also used. If autoSmooth is false, then the handle positions for every spline point are given in the bezierDirs field in API_ElementMemo.
Member Data Documentation
◆ arrowData
 API_SplineType::arrowData
Arrow data for the arc ends.
◆ autoSmooth
 API_SplineType::autoSmooth
Smooth spline automatically, or use the bezierDirs field (of type API_SplineDir) in API_ElementMemo?
◆ closed
 API_SplineType::closed
Is this a closed curve?
◆ determination
 API_SplineType::determination
Line category:
 Category  | Meaning
 APILine_DetOrigin  | Default line category. Lines in the Drafting line category are not affected by the Line Weight and Section Fill settings chosen in Display Options.
 APILine_DetInnerLine  | A skin separator line separates skins of composite structures. Lines in the Skin Separator category will be either hidden or shown depending on the Cut Fill type chosen in Display Options. Also, lines in the Skin Separator category can be optionally placed onto their own layer during DXF/DWG conversion functions.
 APILine_DetContourLine  | Lines in the Cut line category will be affected if you have chosen the 'Bold Cut Line' setting in the Line Weight menu of Display Options.
◆ head
 API_SplineType::head
General element header.
◆ linePen
 API_SplineType::linePen
(Overridden) pen attribute index.
◆ ltypeInd
 API_SplineType::ltypeInd
Line type attribute index.
◆ penWeight
 API_SplineType::penWeight
Pen weight for the arc (can override the weight in linePen, otherwise set it to API_DefPenWeigth : use default weight of the pen).
◆ roomSeparator
 API_SplineType::roomSeparator
Is this arc a zone boundary?